app/controllers/artists_controller.rb

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def index
		@painting = Painting.find_by(id: 10)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		if current_user
			@artist = Artist.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "artists"."id" = $5  [["first_name", "Ricard"], ["last_name", "Montenbruck"], ["password_digest", "$2a$10$8rHmcn.4R9tbYbwWZfOiU.lu6C/6r42X36nfuxI0TYxmFc92jCfbe"], ["updated_at", "2017-05-21 22:32:13.783796"], ["id", 1]]
---
	def update
		if current_user
			@artist = Artist.find(params[:id])
			@artist.assign_attributes(artists_params)
			if @artist.save