app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
	def index
		@paintings = Painting.all.sort_by{|painting| painting.price.tr(',', '').to_i}.reverse

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def new
		if current_user
			@painting = Painting.new
			@artist = Artist.find(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "paintings" ("artist", "artist_email", "artist_phone_number", "name_of_painting", "price", "description", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		if current_user
			@painting = Painting.new(paintings_params)
			@artist = Artist.find(params[:artist_id])
			if @painting.save

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@painting = Painting.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
		if current_user
			@artist = Artist.find(params[:artist_id])
			@painting = Painting.find(params[:id])

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "paintings" SET "name_of_painting" = $1, "updated_at" = $2 WHERE "paintings"."id" = $3  [["name_of_painting", "Great piece"], ["updated_at", "2017-05-20 16:42:42.192032"], ["id", 1]]
---
	def update
		if current_user
			@painting = Painting.find(params[:id])
			@artist = Artist.find(params[:artist_id])
			@painting.assign_attributes(paintings_params)
			if @painting.save

SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "paintings" WHERE "paintings"."id" = $1  [["id", 3]]
---
	def destroy
		if current_user
			@painting = Painting.find(params[:id])
			@painting.delete